In [11]:
import pandas as pd

In [12]:
import numpy as np

In [13]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
print(data)

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002, 2003], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [14]:
frame = pd.DataFrame(data,index = np.arange(1,7,))

In [15]:
frame

    state  year  pop
1    Ohio  2000  1.5
2    Ohio  2001  1.7
3    Ohio  2002  3.6
4  Nevada  2001  2.4
5  Nevada  2002  2.9
6  Nevada  2003  3.2

In [16]:
frame.head()

    state  year  pop
1    Ohio  2000  1.5
2    Ohio  2001  1.7
3    Ohio  2002  3.6
4  Nevada  2001  2.4
5  Nevada  2002  2.9

In [17]:
data = pd.DataFrame(data,columns = ['year','pop','state'])

In [19]:
data

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [21]:
data['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [27]:
data.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [28]:
data.loc[3]

year       2001
pop         2.4
state    Nevada
Name: 3, dtype: object

In [32]:
data = pd.DataFrame(data,columns = ['year','pop','state','debt'])

In [33]:
data

   year  pop   state  debt
0  2000  1.5    Ohio   NaN
1  2001  1.7    Ohio   NaN
2  2002  3.6    Ohio   NaN
3  2001  2.4  Nevada   NaN
4  2002  2.9  Nevada   NaN
5  2003  3.2  Nevada   NaN

In [34]:
data.debt

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: debt, dtype: float64

In [37]:
data['debt'] = data['pop']*10

In [38]:
data

   year  pop   state  debt
0  2000  1.5    Ohio  15.0
1  2001  1.7    Ohio  17.0
2  2002  3.6    Ohio  36.0
3  2001  2.4  Nevada  24.0
4  2002  2.9  Nevada  29.0
5  2003  3.2  Nevada  32.0

In [39]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},      
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [55]:
data2 = pd.DataFrame(pop)

In [56]:
data2

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [57]:
data2.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6